function p = params_model()
%% ================== 系统参数（五连杆） ==================
% 符号   含义                                   单位
% -------------------------------------------------------------------

%% 几何参数
p.Rw  = 0.135/2;          % R_w   驱动轮半径                         [m]
p.Dw  = 0.135;            % D_w   驱动轮间距/2                       [m]
p.Ll  = 0.20;             % L_l   虚拟腿长度                         [m]
p.Lwc = 0.1*p.Ll;         % L_wc  轮质心 → 虚拟腿质心                 [m]
p.Lcp = 0.9*p.Ll;         % L_cp  虚拟腿质心 → 髋关节                 [m]
p.Lpb = 0.022962;         % L_pb  髋关节 → 机体质心                   [m]

%% 质量参数
p.Mw = 0.52417;           % M_w   驱动轮质量                         [kg]
p.Ml = 0.9517;            % M_l   虚拟腿质量                         [kg]
p.Mb = 12.1846;           % M_b   机体质量                           [kg]

%% 转动惯量
p.Iw = 0.000600313;                           % I_w   驱动轮转动惯量       [kg·m^2]
p.Il = 0.00594;                               % I_l   虚拟腿转动惯量       [kg·m^2]
p.Ib = p.Mb*p.Lpb^2 + p.Mb*(0.2^2+0.1^2)/12;  % I_b   机体转动惯量         [kg·m^2]
p.Iz = 0;                                     % I_z   机体绕 z 轴转动惯量   [kg·m^2]

%% 环境参数
p.g  = 9.80665;           % g     重力加速度                         [m/s^2]

end